Connect With Fourth Network  192.168.1.128/26

R2>en
R2#show ip inter brie
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   unassigned      YES unset  administratively down down 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
Serial0/1/0            unassigned      YES unset  administratively down down 
Serial0/1/1            unassigned      YES unset  administratively down down 
Loopback0              2.2.2.2         YES manual up                    up 
Vlan1                  unassigned      YES unset  administratively down down
R2#conf ter
Enter configuration commands, one per line.  End with CNTL/Z.

R2(config)#interface gigabitEthernet 0/0/0
R2(config-if)#ip addre
R2(config-if)#ip address 192.168.1.190 255.255.255.192
R2(config-if)#no shut

R2(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

R2(config-if)#end

R2#show ip inter brie
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   192.168.1.190   YES manual up                    up 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
Serial0/1/0            unassigned      YES unset  administratively down down 
Serial0/1/1            unassigned      YES unset  administratively down down 
Loopback0              2.2.2.2         YES manual up                    up 
Vlan1                  unassigned      YES unset  administratively down down
_____________________________________________________________________________________________
Connect With Fourth Network  192.168.1.192/26

R2>en
R2#show ip inter brie
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   192.168.1.190   YES manual up                    up 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
Serial0/1/0            unassigned      YES unset  administratively down down 
Serial0/1/1            unassigned      YES unset  administratively down down 
Loopback0              2.2.2.2         YES manual up                    up 
Vlan1                  unassigned      YES unset  administratively down down

R2#conf ter
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#

R2(config)#interface serial 0/1/0
R2(config-if)#no shut

R2(config-if)#
%LINK-5-CHANGED: Interface Serial0/1/0, changed state to up

R2(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/0, changed state to up

R2(config-if)#ip address 192.168.1.193 255.255.255.192
R2(config-if)#end
R2#
%SYS-5-CONFIG_I: Configured from console by console

R2#show ip inter brie
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   192.168.1.190   YES manual up                    up 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
Serial0/1/0            192.168.1.193   YES manual up                    up 
Serial0/1/1            unassigned      YES unset  administratively down down 
Loopback0              2.2.2.2         YES manual up                    up 
Vlan1                  unassigned      YES unset  administratively down down